# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 3, C2f, [128, True]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 6, C2f, [256, True]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 6, C2f, [512, True]]     # 6
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 3, C2f, [1024, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]      # 9
  - [-1, 1, CBAMBlock, [16, 49]]    # 10

# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12, cat backbone P4
  - [-1, 3, C2f, [512]]                         # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15, cat backbone P3
  - [-1, 3, C2f, [256]]                         # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 17
  - [[-1, 13], 1, Concat, [1]]                  # 18, cat head P4
  - [-1, 3, C2f, [512]]                         # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 20
  - [[-1, 9], 1, Concat, [1]]                   # 21, cat head P5
  - [-1, 3, C2f, [1024]]                        # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]             # 23, Detect(P3, P4, P5)
